Revit 2024 API
BuiltInFailures.DebugTabBindingFailures Class
 Failures related to binding framework demo panel on Ribbon Debug Tab.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DebugTabBindingFailures
Visual Basic
Public NotInheritable Class DebugTabBindingFailures
Visual C++
public ref class DebugTabBindingFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DebugTabBindingFailures
See Also
BuiltInFailures.DebugTabBindingFailures Members
Autodesk.Revit.DB Namespace